{
  "id": "a96d2a90-9341-11ed-b1eb-0242ac120003",
  "created_by": "Meo",
  "name": "T1059 - Malicious Command Execution via Python",
  "tags": ["attack.execution","attack.t1059"
  ],
  "interval": "5m",
  "description": "Detects malicious use of Python to execute commands.",
  "risk_score": 74,
  "enabled": true,
  "severity": "high",
  "false_positives": ["Python usage by developers or system administrators"],
  "from": "now-5m",
  "type": "query",
  "language": "lucene",
  "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*"],
  "query": ""process.command_line:*import\\ requests*"",
  "rule_id": "a96d2a90-9341-11ed-b1eb-0242ac120003",
  "timestamp_override": "event.ingested",
  "references": [],
  "note": ""
}
