# lucene-kibana-siemrule.yml
vars:
  index_names: 
    - "apm-*-transaction*"
    - "auditbeat-*"
    - "endgame-*"
    - "filebeat-*"
    - "logs-*"
    - "packetbeat-*"
    - "traces-apm*"
    - "winlogbeat-*"
  schedule_interval: 5
  schedule_interval_unit: m
  severity_risk_mapping:
    low: 21
    medium: 44
    high: 74
    critical: 99

postprocessing:
- type: template
  template: >-
    {"id": "{{ rule.id }}", "created_by": "{{ rule.author }}", "name": "{{ rule.title }}", "tags": [{%- for t in rule.tags -%}"{{ t.namespace }}.{{ t.name }}"{{ "," if not loop.last }}{%- endfor -%}], "interval": "{{ pipeline.vars.schedule_interval }}{{ pipeline.vars.schedule_interval_unit }}", "description": "{{ rule.description }}", "risk_score": {{ pipeline.vars.severity_risk_mapping[rule.level.name | lower] if rule.level is not none else 21 }}, "enabled": true, "severity": "{{ rule.level.name | lower if rule.level is not none else 'low' }}", "false_positives": {{ rule.falsepositives | tojson }}, "from": "now-{{ pipeline.vars.schedule_interval }}{{ pipeline.vars.schedule_interval_unit }}", "type": "query", "language": "lucene", "index": {{ pipeline.vars.index_names | tojson }}, "query": {{ query | tojson }}, "rule_id": "{{ rule.id }}", "timestamp_override": "event.ingested", "references": {{ rule.references | tojson(indent=6) }}, "note": "{{ rule.note }}"}
#    {
#      "id": "{{ rule.id }}",
#      "created_by": "{{ rule.author }}",
#      "name": "{{ rule.title }}",
#      "tags": [
#        {%- for t in rule.tags -%}
#          "{{ t.namespace }}.{{ t.name }}"{{ "," if not loop.last }}
#        {%- endfor %}
#      ],
#      "interval": "{{ pipeline.vars.schedule_interval }}{{ pipeline.vars.schedule_interval_unit }}",
#      "description": "{{ rule.description }}",
#      "risk_score": {{ pipeline.vars.severity_risk_mapping[rule.level.name | lower] if rule.level is not none else 21 }},
#      "enabled": true,
#      "severity": "{{ rule.level.name | lower if rule.level is not none else 'low' }}",
#      "false_positives": {{ rule.falsepositives | tojson }},
#      "from": "now-{{ pipeline.vars.schedule_interval }}{{ pipeline.vars.schedule_interval_unit }}",
#      "type": "query",
#      "language": "lucene",
#      "index": {{ pipeline.vars.index_names | tojson }},
#      "query": "{{ query | tojson }}",
#      "rule_id": "{{ rule.id }}",
#      "timestamp_override": "event.ingested",
#      "references": {{ rule.references | tojson(indent=6) }},
#      "note": "{{ rule.note }}"
#    }
