# lucene-kibana-siemrule.yml
vars:
  default_interval: "5m"
  default_from: "now-720s"
  default_index: 
    - "apm-*-transaction*"
    - "auditbeat-*"
    - "endgame-*"
    - "filebeat-*"
    - "logs-*"
    - "packetbeat-*"
    - "traces-apm*"
    - "winlogbeat-*"
    - "-*elastic-cloud-logs-*"

postprocessing:
  - type: template
    template: |+
      {
        "id": "{{ rule.id }}",
        "created_by": "{{ rule.author }}",
        "name": "{{ rule.title }}",
        "tags": {{ rule.tags | tojson }},
        "interval": "{{ rule.interval | default(pipeline.vars.default_interval) }}",
        "description": "{{ rule.description }}",
        "risk_score": {{ rule.risk_score }},
        "enabled": {{ rule.enabled | default(true) }},
        "severity": "{{ rule.severity }}",
        "false_positives": {{ rule.false_positives | tojson }},
        "from": "now-720s",
        "type": "query",
        "language": "lucene",
        "index": {{ pipeline.vars.default_index | tojson }},
        "query": "{{ rule.query }}",
        "rule_id": "{{ rule.id }}",
        "timestamp_override": "{{ rule.timestamp_override }}",
        "references": {{ rule.references | tojson }},
        "note": "{{ rule.note }}"
      }
