title: 'Windows System Event Log Cleared'
status: experimental
description: 'Detects when the Windows System eventlog has been cleared by looking for event id 104'
author: 'Josh Brower'
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 104
  condition: selection
falsepositives:
  - None
fields:
  - SubjectUsername
level: high
